#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/orga_vis/snowflake_project_workspace_test/runs/run-ahNS72LWNRedYt1h

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...
snowflake_database.db: Refreshing state... [id=TEST_POC_VISEO_DB]
snowflake_warehouse.warehouse: Refreshing state... [id=TEST_WH]
snowflake_account_role.role: Refreshing state... [id=TEST_POC_VISEO_ROLE]
snowflake_grant_account_role.rolegrant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|ROLE|"SYSADMIN"]
snowflake_grant_account_role.grants: Refreshing state... [id="TEST_POC_VISEO_ROLE"|USER|"TERRAF_USER"]
snowflake_grant_privileges_to_account_role.executetask: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|EXECUTE TASK|OnAccount]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE SCHEMA,MODIFY,USAGE,MONITOR|OnAccountObject|DATABASE|"TEST_POC_VISEO_DB"]
snowflake_grant_privileges_to_account_role.future_tables_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|INSERT,SELECT|OnSchemaObject|OnFuture|TABLES|InDatabase|"TEST_POC_VISEO_DB"]
snowflake_schema.raw_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_schema.bronze_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_schema.gold_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_schema.silver_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.warehouse_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|USAGE|OnAccountObject|WAREHOUSE|"TEST_WH"]
snowflake_user.saif_bouaziz: Refreshing state... [id=SAIF_BOUAZIZ]
snowflake_grant_privileges_to_account_role.schema_grant_raw: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_grant_account_role.grant_poc_viseo_role: Refreshing state... [id="TEST_POC_VISEO_ROLE"|USER|"SAIF_BOUAZIZ"]
snowflake_grant_privileges_to_account_role.schema_grant_gold: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_silver: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_bronze: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."BRONZE_LAYER"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_user.amine_snoussi will be created
  + resource "snowflake_user" "amine_snoussi" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "amine_snoussi"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "AMINE_SNOUSSI"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

  # snowflake_user.issam_eddaou will be created
  + resource "snowflake_user" "issam_eddaou" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "issam_eddaou"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "ISSAM_EDDAOU"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

  # snowflake_user.matthieu_noiret will be created
  + resource "snowflake_user" "matthieu_noiret" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "matthieu_noiret"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "MATTHIEU_NOIRET"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

  # snowflake_user.rihab_bahri will be created
  + resource "snowflake_user" "rihab_bahri" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "rihab_bahri"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "RIHAB_BAHRI"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

  # snowflake_user.walid_cheriet will be created
  + resource "snowflake_user" "walid_cheriet" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "walid_cheriet"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "WALID_CHERIET"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

  # snowflake_user.zied_maalej will be created
  + resource "snowflake_user" "zied_maalej" {
      + abort_detached_query                          = (known after apply)
      + autocommit                                    = (known after apply)
      + binary_input_format                           = (known after apply)
      + binary_output_format                          = (known after apply)
      + client_memory_limit                           = (known after apply)
      + client_metadata_request_use_connection_ctx    = (known after apply)
      + client_prefetch_threads                       = (known after apply)
      + client_result_chunk_size                      = (known after apply)
      + client_result_column_case_insensitive         = (known after apply)
      + client_session_keep_alive                     = (known after apply)
      + client_session_keep_alive_heartbeat_frequency = (known after apply)
      + client_timestamp_type_mapping                 = (known after apply)
      + date_input_format                             = (known after apply)
      + date_output_format                            = (known after apply)
      + default_role                                  = "TEST_POC_VISEO_ROLE"
      + default_secondary_roles_option                = "DEFAULT"
      + default_warehouse                             = "TEST_WH"
      + disable_mfa                                   = "default"
      + disabled                                      = "default"
      + display_name                                  = "zied_maalej"
      + enable_unload_physical_type_optimization      = (known after apply)
      + enable_unredacted_query_syntax_error          = (known after apply)
      + error_on_nondeterministic_merge               = (known after apply)
      + error_on_nondeterministic_update              = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + geography_output_format                       = (known after apply)
      + geometry_output_format                        = (known after apply)
      + id                                            = (known after apply)
      + jdbc_treat_decimal_as_int                     = (known after apply)
      + jdbc_treat_timestamp_ntz_as_utc               = (known after apply)
      + jdbc_use_session_timezone                     = (known after apply)
      + json_indent                                   = (known after apply)
      + lock_timeout                                  = (known after apply)
      + log_level                                     = (known after apply)
      + mins_to_bypass_mfa                            = -1
      + mins_to_unlock                                = -1
      + multi_statement_count                         = (known after apply)
      + must_change_password                          = "true"
      + name                                          = "ZIED_MAALEJ"
      + network_policy                                = (known after apply)
      + noorder_sequence_as_default                   = (known after apply)
      + odbc_treat_decimal_as_int                     = (known after apply)
      + parameters                                    = (known after apply)
      + password                                      = (sensitive value)
      + prevent_unload_to_internal_stages             = (known after apply)
      + query_tag                                     = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + rows_per_resultset                            = (known after apply)
      + s3_stage_vpce_dns_name                        = (known after apply)
      + search_path                                   = (known after apply)
      + show_output                                   = (known after apply)
      + simulated_data_sharing_consumer               = (known after apply)
      + statement_queued_timeout_in_seconds           = (known after apply)
      + statement_timeout_in_seconds                  = (known after apply)
      + strict_json_output                            = (known after apply)
      + time_input_format                             = (known after apply)
      + time_output_format                            = (known after apply)
      + timestamp_day_is_always_24h                   = (known after apply)
      + timestamp_input_format                        = (known after apply)
      + timestamp_ltz_output_format                   = (known after apply)
      + timestamp_ntz_output_format                   = (known after apply)
      + timestamp_output_format                       = (known after apply)
      + timestamp_type_mapping                        = (known after apply)
      + timestamp_tz_output_format                    = (known after apply)
      + timezone                                      = (known after apply)
      + trace_level                                   = (known after apply)
      + transaction_abort_on_error                    = (known after apply)
      + transaction_default_isolation_level           = (known after apply)
      + two_digit_century_start                       = (known after apply)
      + unsupported_ddl_action                        = (known after apply)
      + use_cached_result                             = (known after apply)
      + user_type                                     = (known after apply)
      + week_of_year_policy                           = (known after apply)
      + week_start                                    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @WalidVis, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*